Repository: mahadydev/flutter_starter_project
Catalog: lib/app/language/arb/app_*.arb
Languages: ar, bn, ur

source: Hello World!
ar: مرحبا بالعالم!
bn: হ্যালো ওয়ার্ল্ড!
ur: ہیلو ورلڈ!

source: Connection Status
ar: حالة الاتصال
bn: সংযোগের অবস্থা
ur: کنکشن اسٹیٹس

source: Theme
ar: المظهر
bn: থিম
ur: تھیم

source: Toggle Theme
ar: تبديل المظهر
bn: থিম পরিবর্তন করুন
ur: تھیم تبدیل کریں

# themeSwitched
source: Theme switched to {theme}
ar: تم تبديل المظهر إلى {theme}
bn: থিম {theme} এ পরিবর্তন হয়েছে
ur: تھیم {theme} میں تبدیل ہو گیا

source: Language
ar: اللغة
bn: ভাষা
ur: زبان

# languageSwitched
source: Language switched to {lang}
ar: تم تبديل اللغة إلى {lang}
bn: ভাষা {lang} এ পরিবর্তন হয়েছে
ur: زبان {lang} میں تبدیل ہو گئی

# current
source: Current: {value}
ar: الحالي: {value}
bn: বর্তমান: {value}
ur: موجودہ: {value}

source: Networking
ar: الشبكة
bn: নেটওয়ার্কিং
ur: نیٹ ورکنگ

source: Call Network
ar: اتصال بالشبكة
bn: নেটওয়ার্ক কল
ur: نیٹ ورک کال

source: Storage
ar: التخزين
bn: স্টোরেজ
ur: اسٹوریج

source: Save Value
ar: حفظ القيمة
bn: মান সংরক্ষণ করুন
ur: ویلیو محفوظ کریں

source: Read Value
ar: قراءة القيمة
bn: মান পড়ুন
ur: ویلیو پڑھیں

# stored
source: Stored: {value}
ar: المخزن: {value}
bn: সংরক্ষিত: {value}
ur: محفوظ شدہ: {value}

source: Snackbar & Utils
ar: الإشعارات والأدوات
bn: স্ন্যাকবার ও ইউটিলিটি
ur: اسنیک بار اور یوٹیلٹی

source: Show Snackbar
ar: إظهار إشعار
bn: স্ন্যাকবার দেখান
ur: اسنیک بار دکھائیں

# snackbarMessage
source: This is a snackbar from Showcase!
ar: هذا إشعار من شاشة العرض!
bn: এটি শোকেস থেকে একটি স্ন্যাকবার!
ur: یہ اسنیک بار شوکیس سے ہے!

source: Loading...
ar: جار التحميل...
bn: লোড হচ্ছে...
ur: لوڈ ہو رہا ہے...

# error
source: Error: {message}
ar: خطأ: {message}
bn: ত্রুটি: {message}
ur: خرابی: {message}

source: No value found
ar: لا توجد قيمة
bn: কোনো মান পাওয়া যায়নি
ur: کوئی ویلیو نہیں ملی

source: Saved to storage!
ar: تم الحفظ في التخزين!
bn: স্টোরেজে সংরক্ষিত!
ur: اسٹوریج میں محفوظ ہو گیا!

source: Drift Database
ar: قاعدة بيانات دريفت
bn: ড্রিফট ডাটাবেস
ur: ڈرفٹ ڈیٹا بیس

source: Add Item
ar: إضافة عنصر
bn: আইটেম যোগ করুন
ur: آئٹم شامل کریں

source: Clear All
ar: مسح الكل
bn: সব মুছে ফেলুন
ur: سب صاف کریں

source: No items in database.
ar: لا توجد عناصر في قاعدة البيانات.
bn: ডাটাবেসে কোনো আইটেম নেই।
ur: ڈیٹا بیس میں کوئی آئٹم نہیں۔

# itemInfo
source: ID: {id}, Name: {name}, Value: {value}
ar: المعرف: {id}، الاسم: {name}، القيمة: {value}
bn: আইডি: {id}, নাম: {name}, মান: {value}
ur: آئی ڈی: {id}, نام: {name}, ویلیو: {value}
